// JavaScript Document

var para=new Array(8);
para[0]=new Array(6);
para[0][0]="夜深了，一轮圆月挂在空中，皎洁的月光洒满大地，像一层薄薄的面纱，给大地添了一份神秘。";
para[0][1]="庄家地里的稻草人欣赏着这美景，不由自主的唱起了歌来，突然它听到这样的对话。“爷爷，听说月圆时就会有仙女下凡，是真的吗”小枣树问旁边的爷爷。“是的，月圆时天门就打开了，仙女就会下凡来人间，天要亮时就回仙界了”";
para[0][2]="小枣树问爷爷“相传很久以前，一个贪玩的小神仙趁守门人不注意，偷偷下了凡界，误了时辰，没能回到仙界，后来每到月圆之夜就会有仙女下来和他团聚”爷爷打着哈欠答到“仙女是小神仙的母亲吗？她去哪里找小神仙呀？”";
para[0][3]="枣树爷爷回到“那她们为什么要下凡呀？来人间干什么呢？”小枣树没完没了的问道“可能是吧，不早了，快睡吧”";
para[0][4]="爷爷闭着眼说“我要等仙女下凡，给她指路”小枣树望着圆月说。";
para[0][5]="夜深了，微风吹来，地里的庄稼此起彼伏，好像在唱歌，又似在跳舞，在歌声中稻草人睡了，爷爷也睡了，小枣树也渐渐入了梦乡。";

para[1]=new Array(5);
para[1][0]="达拉然一直是个有些特殊的存在，作为人类七国的成员国之一，它的许多方面都和另外六个国家有着天壤之别。";
para[1][1]="这是一座魔法之城，其国民有很大一部分是由法师和学徒组成。";
para[1][2]="和那些即便非战时也有着军队守卫的国家相比，达拉然更像一所高等学府，必要时学徒们能立刻从国民的角色转变为可靠的防御力量。";
para[1][3]="而在这样深藏不露的达拉然，说话最掷地有声的组织非肯瑞托莫属，它的首领则在保护这座城市的同时肩负着类似于校长的职责。";
para[1][4]="“校长”要在意的，不仅仅是学术方面的研究和教学质量，往往还要注意周边城市对这所学校的态度。";

para[2]=new Array(6);
para[2][0]="许有人会问：“这个世界是如何形成的？” 在所有现存世界中，为什么这个世界的属性如此奇特，如此多样化，其中的生物，文化和传说更是数不胜数呢？";
para[2][1]="答案，有人低语道，“就在于巨神们。”";
para[2][2]="我们所知的上古巨神是伟大的创造者，他曾在创世的熔炉研习。";
para[2][3]="在磨砺技艺时，他打碎了一样东西，无法修复、只能放弃的东西。他陷入了自己破碎的世界，这也是他自己破碎的灵魂。";
para[2][4]="他滞留所在的位面里全是参差不齐的碎片和漫山遍野的裂缝，还有其他从初生宇宙裂缝中散落的失落残片。这就解释了为什么众所周知的世界形似一座小岛，岛上尽是失事船只上的幸存者，现在这些落难之人早已在历史长河中被忘却。";
para[2][5]="世人虽无记忆，但是自责的人除外。他将永世寻找方法去完成修复工作，寻找再次与他残破的灵魂结合的方法，寻找修复世人和世界的方法。这就是我们所知的上古巨神。";

para[3]=new Array(7);
para[3][0]="艾欧存在于所有地方和世间万物之内。";
para[3][1]="敌人们诋毁它为灭绝者，学者们则尊崇它为闪动的神圣之眼，艾欧同时在所有位面存在着，它们可以在任何时候将自己身体的一小部分转化为物理存在。";
para[3][2]="就像伟大的双子骑士“暗”与“光”，还有一位来历已淹没在时间中的远古旅者一样，精灵守卫艾欧也是宇宙的基本法则，比时间还要古老，来自凡人无法理解的领域。";
para[3][3]="艾欧不仅仅是物质内部的吸引力和排斥力的结合，它是将实体连接在一起的电荷的直观体现。";
para[3][4]="只有将这些力量进行可控的扭曲，艾欧才能在物理位面被人感受到。";
para[3][5]="作为一股善意、乐于合作的力量，艾欧将它的力量与其它人绑在一起，让盟友的力量得到强化。";
para[3][6]=" 它的心思深不可测，它的力量无法想象，艾欧在物理位面穿梭着，是神秘宇宙的完美体现。";

para[4]=new Array(5);
para[4][0]="曾经在Lordaeron有一个贪婪到已经不值得任何怜悯的人。";
para[4][1]="终于，在试图偷取Arthas王子的圣戒时被抓获并被判绞刑。";
para[4][2]="他因盗窃的欲望而腐蚀的身体后来以食尸鬼的形态复生。";
para[4][3]="他已经不记得自己的名字了，只知道现在自己是N`aix，欲望和贪婪的化身。";
para[4][4]="他现在从他遇见的每一个生物那里贪婪的偷取生命。";


para[5]=new Array(6);
para[5][0]="天界之王，众神之父，宙斯对待英雄一向视如己出。";
para[5][1]="然而在无数次与凡间的女性幽会时当场被抓后，宙斯接到了妻子给他下的最后通牒：";
para[5][2]="“既然你这么喜欢凡人，就去当凡人吧。如果你能证明的忠诚，就回来做我永生的丈夫。不然的话，就去和你的创造物一起去死吧。”";
para[5][3]="宙斯无奈的发现她的逻辑（和她的魔法）无懈可击，只好照她说的去做。";
para[5][4]="从那以后宙斯洗心革面，在凡人面前不再多情，将爱留给他永生的女神。";
para[5][5]="但为了证明他配得上永恒的爱妻，他必须在战场上，大获全胜。";


para[6]=new Array(7);
para[6][0]="厄泽王庭的教皇有个隐秘的受虐癖——以品尝禁忌之痛为乐。即便是对那些普通政客而言这都是愚蠢至极的，而对于教皇而言，这种私欲已经威胁到了神权本身的纯洁和完整。";
para[6][1]="于是他只好偷偷的去他的地牢里，求助于那一帮恶魔学识大师，承诺只要有人召唤一名完全为他服务的痛苦女妖，那就能获得自由。";
para[6][2]="旋即魔女降世，名为阿卡莎，她给教皇带去了无与伦比的痛苦和刺激，教皇随即赐其隐秘皇后之位，并将所有闲暇时间用于享受她带来的花样百出的痛苦";
para[6][3]="——最终，为了追求这种只有阿卡莎能带给他的痛苦，教皇放弃了他的所有职责。";
para[6][4]="痛苦女王能让他体验濒死之欢愉，并因为受符文的限制而无法杀死他。";
para[6][5]="终于，教皇的不理朝政引发了起义，他被愤怒的人们从密室里拖出来，然后从祈灵塔上扔了下去。";
para[6][6]="然而，他的死亡却让痛苦女王获得了自由，不再被奴役，她将恣意的向世界挥洒她的痛苦。";

para[7]=new Array(6);
para[7][0]="谜团的背景正如同其名字一样，无人知晓。只有一些流传下来的故事和传说，但大多数都不可信。";
para[7][1]="事实上，关于谜团的各种故事，都只是寥寥的描述，神秘无比：";
para[7][2]="他是宇宙之力，世界的吞噬者。他是虚空中的存在，有时会以物质形态出现，其它时候则以非物质形态存在。他是同时存在于多个位面的生物。";
para[7][3]="在有的传说中，他曾经是一个试图解开宇宙之谜的伟大炼金术士，但最后却因为自己的傲慢而受到诅咒。";
para[7][4]="在其它传说中，他来自远古，是一种不可思议的重力生命体，是来自原始黑暗的扭曲声音，在宇宙中的第一丝光线诞生前就存在的深渊化身。";
para[7][5]="还有更古老的传说，说他是第一颗崩塌的恒星，产生的黑洞变成了有知觉的复杂存在，他的动机无从得知，他的力量无法阻挡，他的存在就是毁灭之力本身。";



var timer;
var t2;
function load(id){
	clearInterval(timer);
	clearInterval(t2);
	var sr="url('img/?.jpg')";
	var num=String(id);
	sr=sr.replace('?',num);
	
	var img=document.getElementById("pic");
	img.style.backgroundImage=sr;
//	t2=setInterval(function(){
//		var img=document.getElementById("pic");
//		img.style.backgroundImage=sr;
//	},10);
	
	var ps=document.getElementsByTagName("p"),i;
	for(i=0;i<ps.length;i++){
		ps[i].innerHTML="";
	}
	var i=0,j=0;
	timer=setInterval(function(){
		j++;
		ps[i].innerHTML=para[id][i].substr(0,j);
		if(j>=para[id][i].length){
			j=0,i++;
		}
		if(i>=para[id].length){
			clearInterval(timer);
		}
	},10);
}
